# print ('Hello, World!')
# print ('Hello, Bratya!')


###Арифметика###
# + - * /
# // [целочисленное деление (деление без остатка)]
#  ** [возведение в степень]
#  % - [остаток]  ### когда остается 0 в остатке означает что число ровно делится



# print (148 // 3)
# print (148 / 3)
# print (2 ** 5)
# print (5 ** 2)
# print (49 ** 0.5) 0.5 для того чтобы взять число в квадратный корень. всегда будет оставаться остаток внезависимости от примера
# print (40 / 10) при делении всегда будет оставаться остаток внезависимости от примера
# print (14 % 4) ближайшее число делитель четырех 12. 2 остается в остатке
# print (26 % 10) ближайшее число делитель десяти 20. 6 остается в остатке


# Я начал изучать "python"
# print ("Я начал изучать "python"")   #Изоляция ЭТО НЕПРАВИЛЬНЫЙ ВАРИАНТ
# print ('Я начал изучать \'python\'') ЭТО ПРАВИЛЬНЫЙ ВАРИНТ (знаком \ мы изолировали слово пайтон)
# print ("Я изучаю 'python'") ЭТО ТОЖЕ ПРАВИЛЬНЫЙ ВАРИАНТ (мы поставили разные ковычки в коде)
# print ('Салам всем,')
# print ('я изучаю "python"')

# print ('Салам всем, \nя изучаю "python')

# print ("Эмир" + "Гараев")
# print ("Эмир" + " " + "Гараев")

print ("zxc" * 5)